
[
    {
        "title": "About LeaseLync: What is it and who is it for?",
        "content": "LeaseLync is a comprehensive, mobile-first web application designed to help landlords and property managers of all scales—from those with a single unit to those overseeing large portfolios—efficiently manage their rental properties. It provides a centralised dashboard with a suite of powerful tools for tracking income and expenses, managing property and tenant details, monitoring maintenance tasks, generating financial reports, and staying on top of tenant arrears. The goal of LeaseLync is to simplify property management, automate financial tracking, and provide clear, actionable insights into the performance of your real estate assets, all in one accessible place."
    },
    {
        "title": "How do I navigate the app?",
        "content": "LeaseLync is designed to be mobile-first and intuitive, using a few key navigation elements to help you find everything you need.\n\n1.  **Bottom Navigation Bar:** This is your primary navigation tool, always visible at the bottom of the screen. It provides instant access to the four main sections of the app:\n    *   **Dashboard:** Your home screen. It gives you an immediate, high-level overview of your portfolio's financial health with key metrics (KPIs) and cash flow charts.\n    *   **Menu:** The central hub for accessing every feature. If you can't find something, start here. It's an organized list of links to all management pages like Properties, Revenue, Expenses, and analysis tools like Reports and Calendar.\n    *   **Activity:** A real-time chronological feed of all significant events and changes made within your account. This is your audit trail for new properties, updated tenancies, logged expenses, and more.\n    *   **Account:** This is where you manage your application preferences and user profile. You can change your password, adjust settings like currency and date format, manage your subscription, and customize the AI's knowledge base.\n\n2.  **Menu Page:** Think of this page as the app's detailed table of contents. It provides a visual grid of every single feature, neatly organized into categories like 'Manage' and 'Analyze'. It's the best place to explore all the capabilities of LeaseLync.\n\n3.  **Page Headers:** At the top of each page, a clear header tells you where you are and provides context-specific action buttons. For example, on the 'Properties' page, you'll find an 'Add Property' button, while the 'Reports' page will have a 'Generate Report' button."
    },
    {
        "title": "How do I sign up or log in?",
        "content": "LeaseLync uses a simplified, unified authentication system designed for ease of use. To get started, navigate to the Login page.\n\n1.  **Enter your email and a password** (must be at least 6 characters).\n2.  **Click 'Login or Sign Up'.**\n\n- If an account with that email **already exists**, the system will log you in.\n- If an account with that email **does not exist**, a new account will be created for you automatically with those credentials, and you'll be logged in.\n\nThis streamlined process means you don't have to worry about separate sign-up and login forms. If you ever forget your password, you can use the 'Forgot Password?' link on the login page to securely reset it via an email link."
    },
    {
        "title": "How does the Dashboard work?",
        "content": "The Dashboard is your command center, providing a high-level, at-a-glance overview of your entire portfolio's financial health. It consists of two main parts:\n\n1.  **Key Performance Indicators (KPIs):** These are six cards at the top of the page showing critical, real-time metrics:\n    *   **Total Property Value:** The sum of the 'Current Value' of all properties in your portfolio.\n    *   **Total Portfolio Equity:** Your net worth in property assets, calculated as Total Property Value minus the total outstanding Mortgage balances.\n    *   **Revenue (This Month):** Total income received in the current calendar month.\n    *   **Expenses (This Month):** Total costs incurred in the current calendar month.\n    *   **Net Operating Income:** The difference between monthly revenue and expenses (profit before tax). This card will change color to red for a loss or green for a profit.\n    *   **Arrears:** The total amount of outstanding payments currently owed by all tenants.\n\n2.  **Charts & Graphs:**\n    *   **Overview Area Chart:** This chart shows your revenue vs. expenses over the last six months, giving you a clear visual of your cash flow trends.\n    *   **Profit by Property Bar Chart:** This horizontal bar chart breaks down the year-to-date, after-tax profit for each individual property, helping you quickly identify your most and least profitable assets."
    },
    {
        "title": "How do I manage my properties?",
        "content": "All property management is handled from **Menu > Properties**. This page serves as your central directory for every asset you own.\n\n- **Adding a Property:** Click the 'Add Property' button to open a form. Here you can input all the essential details of a property.\n- **Key Information:** You can store the full address, property type (Domestic for residential or Commercial), and building type (e.g., Flat, Detached House, Office). You can also log specifications like the number of bedrooms, bathrooms, and floor size.\n- **Financials:** Critically, this is where you input the financial data for each property, including its purchase price, purchase-related taxes & fees, current market value, outstanding mortgage balance, and the target or asking rent you aim to achieve.\n- **Viewing & Editing:** All your properties are listed in a table. You can click on any property to go to its dedicated detail page, where you can view all its information in one place. From either the list or the detail page, you can choose to edit or delete a property."
    },
    {
        "title": "How do I track revenue and tenancies?",
        "content": "All income is managed by creating and maintaining tenancies. You can find this section under **Menu > Revenue**.\n\n- **Creating a Tenancy:** Revenue is not logged as one-off payments. Instead, you create a 'Tenancy' by clicking the 'Add Tenancy' button. A tenancy links a specific tenant to one of your properties for a defined lease period (e.g., July 6, 2025, to July 5, 2026).\n\n- **Automated Record Generation:** When you create a tenancy, you set the base monthly rent, a one-time security deposit (due with the first payment), and any fixed monthly service charges (like security or trash collection). The application then automatically generates a payment record for every month of the lease term, based on the day of the month the tenancy started. For example, a tenancy starting on July 6th will have due dates on July 6th, August 6th, September 6th, and so on.\n\n- **Recording Payments:** From the main Revenue page, you can see a summary of all tenancies. Click on a specific tenancy to see its detailed monthly breakdown. Here, you can record payments against each month's invoice.\n\n- **Handling Variable Charges:** If you need to add a one-time or variable charge to a specific month (e.g., a metered water bill), you can click 'Edit Invoice' for that month and add or adjust the service charges as needed without affecting other months."
    },
    {
        "title": "How do I handle a tenancy that ends early?",
        "content": "You can easily adjust a tenancy if a tenant leaves before the original lease end date. First, navigate to **Menu > Revenue** and click on the specific tenancy you wish to modify. On the tenancy detail page, you will find an 'End Tenancy' button in the header.\n\nClicking this button will open a dialog where you can select a new, earlier end date. When you confirm this change, the application will automatically perform a cleanup action: it will find and permanently delete all future, unpaid rent records that were scheduled after this new end date. This ensures your financial projections and arrears calculations remain accurate and do not include amounts that are no longer due."
    },
    {
        "title": "How do I manage maintenance and repairs?",
        "content": "All maintenance tasks, from minor repairs to major renovations, are managed on the **Menu > Maintenance** page. This section features a powerful Kanban-style board that allows you to visually track the progress of each task.\n\n- **Workflow Stages:** The board is divided into four columns representing the lifecycle of a task: 'To Do', 'In Progress', 'Done', and 'Cancelled'.\n\n- **Creating a Request:** You can create a new request, describe the issue, assign it a priority level (from Low to Emergency), and link it to a specific property and one of your saved contractors.\n\n- **Tracking Progress:** You can easily move a task from one column to another by using the dropdown menu on the task card. This gives you a clear and immediate overview of all ongoing work.\n\n- **Logging Costs & Expenses:** Once a task is moved to the 'Done' column, you can log the final cost. A 'Create Expense' button will then become available on the task card. Clicking this creates a pre-filled expense record with all the details from the maintenance job, which you can then save directly to your expense log. This seamless integration saves time and prevents double-entry."
    },
    {
        "title": "How do I manage contractors and vendors?",
        "content": "LeaseLync allows you to keep an organized directory of your trusted contractors and service providers. Navigate to **Menu > Contractors** to access this feature. Here, you can add, view, edit, or delete contractor profiles. For each contractor, you can store their name, specialty (e.g., Plumbing, Electrical, General), contact details (email and phone), and any other relevant notes. This list is then directly integrated with the Maintenance section, allowing you to quickly assign jobs to the correct vendor, keeping all your records neat and inter-connected."
    },
    {
        "title": "How do I manage expenses?",
        "content": "You can log and track all your property-related costs by navigating to **Menu > Expenses**. The expense form is designed to capture all necessary details for accurate bookkeeping.\n\n- **Categorisation:** You can assign each expense to a category (e.g., Repairs, Insurance, Management Fees) and link it to a specific property or mark it as a general business expense.\n\n- **Vendor Linking:** You can link the expense to a contractor from your saved list, making it easy to track how much you're spending with each vendor.\n\n- **One-off vs. Recurring:** The system supports both 'One-off' expenses for singular costs and 'Recurring' expenses for regular payments like management fees or subscriptions. For recurring expenses, you can set a frequency (e.g., monthly, quarterly).\n\n- **Receipts & Notes:** You can add notes for context and include a URL to an online receipt or document (e.g., a link to a PDF in Google Drive or Dropbox)."
    },
    {
        "title": "What kind of reports can I generate?",
        "content": "The **Menu > Reports** page offers powerful tools to understand your business's performance. It is split into two main tabs:\n\n1.  **Revenue Analysis:** This interactive dashboard is designed for you to explore revenue performance. It features a chart comparing your 'Gross Potential Income' (what you should have earned) against your 'Net Rental Income' (what you actually collected). This view clearly visualizes losses from vacant properties and unpaid rent (credit loss). You can toggle the view between a 'Month' or 'Year' scope and navigate through different time periods.\n\n2.  **P&L Statement:** This tab provides a live, interactive Profit and Loss statement. It summarises your total revenue and expenses for a selected period and breaks them down into tables. It also calculates your Net Operating Income and an estimated after-tax profit. Like the Revenue Analysis, you can switch between 'Month' and 'Year' views.\n\nIn addition to these dashboards, you can use the AI-powered report generators (buttons in the page header):\n- **AI-Powered P&L Statements:** This tool generates a formal, downloadable Profit and Loss statement, complete with a narrative executive summary. It's suitable for sharing with banks or investors.\n- **AI-Powered Market Research:** This tool provides an in-depth analysis of how your properties' rental prices compare to current market rates, complete with data-backed recommendations for adjustments."
    },
    {
        "title": "How can I see who is behind on rent?",
        "content": "Navigate to **Menu > Arrears**. This page is your dedicated collections center and automatically displays a list of all tenants who have outstanding balances on payments that are past their due date. For each tenant in arrears, the table clearly shows:\n\n- How much is owed.\n- Which property the arrears relate to.\n- How many days the payment is overdue.\n\nTo help you take action, two options are provided:\n1.  **Send Reminder:** This button opens your default email client with a pre-filled, professional email to the tenant, which you can review and send.\n2.  **Request Payment:** This button opens a dialog to initiate a payment request. This feature is designed for future integration with payment gateways like Pesapal or InstaSend to automate M-Pesa payment requests directly to the tenant's phone."
    },
    {
        "title": "What is the Calendar for?",
        "content": "Navigate to **Menu > Calendar**. The Calendar provides a visual timeline of important events across your entire portfolio, helping you see what's happening at a glance. It automatically populates with key dates from other sections of the app, including:\n\n- **Tenancy Events:** Tenancy start and end dates.\n- **Financial Events:** Dates of logged expense transactions.\n- **Maintenance Events:** The reported dates for all maintenance requests.\n\nThis centralized view helps you anticipate vacancies, track when expenses were incurred, and see when maintenance issues were first reported, all in one convenient monthly layout."
    },
    {
        "title": "Can I change the currency or other settings?",
        "content": "Yes, full customisation is available. Navigate to **Account** using the main bottom navigation bar. This page is where you manage all your personal and application-wide settings. It is organized into three tabs:\n\n- **Profile & Settings:** This is where you control the core experience of the app. You can change the display currency (e.g., KES, USD), set your preferred date format (e.g., DD/MM/YYYY), and choose a visual theme (Light, Dark, or System). You can also set your company name to be used in reports, define your tax residency status for accurate P&L calculations, and change your account password.\n\n- **Subscription:** This tab allows you to view and manage your LeaseLync subscription plan.\n\n- **Knowledge Base:** This powerful feature allows you to add, edit, or remove the help articles that are used by the app's AI chat and help search system. Customising this allows the AI to provide answers tailored to your specific needs or business processes."
    },
    {
        "title": "What is the Activity Feed for?",
        "content": "Navigate to **Activity** using the main bottom navigation bar. The Activity Feed serves as a comprehensive, real-time audit trail for every significant action taken within your account. It displays a chronological list of events, such as:\n\n- A new property being added.\n- A tenancy being created or updated.\n- An expense being logged.\n- A payment being recorded.\n- A maintenance request status being changed.\n\nEach entry is timestamped and includes a clear description of the action, the type of entity it affected (e.g., 'Property', 'Tenancy'), and who performed it. This makes it easy to review recent changes and keep track of all administrative activities across your portfolio."
    }
]
