
[
    {
        "category": "Getting Started",
        "questions": [
            {
                "title": "What is PropTraka and who is it for?",
                "content": "<b>PropTraka is a property management app designed for landlords and property managers of any scale.</b><br/><br/>It simplifies rental management by providing a central dashboard to track finances, manage properties and tenants, monitor maintenance, and generate insightful reports, helping you run your portfolio more efficiently."
            },
            {
                "title": "How do I sign up or log in?",
                "content": "<b>You can sign in or create an account using your email and password or your Google account.</b><br/><br/>Simply head to the Sign In page. If you use an email that isn't registered, an account will be created for you automatically. For a password-free experience, use the 'Sign in with Google' option. If you forget your password, you can use the 'Forgot Password?' link to reset it."
            },
            {
                "title": "How do I navigate the app?",
                "content": "<b>Navigate the app using the main Bottom Navigation Bar and the AI Assistant.</b><br/><br/>The app's primary navigation consists of:<br/><ul><li><b>Dashboard:</b> Your home screen with a high-level financial overview.</li><li><b>Menu:</b> The central hub to access all features like Properties, Revenue, and Reports.</li><li><b>Activity:</b> A real-time feed of all changes made in your account.</li><li><b>Account:</b> Manage your profile, app settings, and subscription.</li></ul>You can also use the floating chat bubble to ask the AI for help at any time."
            },
            {
                "title": "How does the Dashboard work?",
                "content": "<b>The Dashboard gives you an instant, high-level overview of your portfolio's financial health.</b><br/><br/>It features two main sections:<br/><ul><li><b>Key Performance Indicators (KPIs):</b> These cards at the top show your most critical live metrics, including Total Property Value, Portfolio Net Worth, monthly Revenue and Expenses, Net Operating Income, and total Arrears.</li><li><b>Charts & Graphs:</b> These visuals show your cash flow trends over the last six months and a breakdown of your year-to-date, after-tax profit for each individual property.</li></ul>"
            }
        ]
    },
    {
        "category": "Core Features",
        "questions": [
            {
                "title": "How do I manage my properties?",
                "content": "<b>Manage all your properties from the 'Properties' page, accessible via the main Menu.</b><br/><br/>From here, you can add, view, and edit every asset in your portfolio. When adding a property, you can log its address, type (Domestic or Commercial), building specifications, and crucial financial data like its purchase price, current value, mortgage balance, and target rent."
            },
            {
                "title": "How do I track revenue and create a tenancy?",
                "content": "<b>Track income by creating 'Tenancies' on the 'Revenue' page from the main Menu.</b><br/><br/>Instead of logging one-off payments, you create a tenancy that links a tenant to a property for a specific lease period. When you set the monthly rent, deposit, and any service charges, the app automatically generates an invoice record for every month of the lease, saving you manual data entry."
            },
            {
                "title": "How do I record a payment from a tenant?",
                "content": "<b>Record payments within a specific tenancy's detail page.</b><br/><br/>First, navigate to <b>Menu > Revenue</b> and click on the tenancy you wish to update. This will take you to the monthly breakdown for that tenant. Find the month you want to record a payment for and use the action menu (...) to select 'Record Payment'. You can then enter the amount paid."
            },
            {
                "title": "How do I manage expenses?",
                "content": "<b>Log all property-related costs from the 'Expenses' page, found in the main Menu.</b><br/><br/>The expense form lets you categorise each cost (e.g., Repairs, Insurance), link it to a specific property or mark it as a general business expense, and assign it to a contractor. You can also specify if it's a one-off or recurring expense and attach a link to a receipt for your records."
            },
            {
                "title": "How do I handle a tenancy that ends early?",
                "content": "<b>End a tenancy early from its detail page to automatically clean up future unpaid rent records.</b><br/><br/>Navigate to <b>Menu > Revenue</b> and click on the relevant tenancy. In the header, click the 'End Tenancy' button and select the new, earlier end date. The app will automatically find and delete any future, unpaid invoices scheduled after this date, ensuring your financial records remain accurate."
            },
            {
                "title": "How can I see who is behind on rent?",
                "content": "<b>Use the 'Arrears' page from the main Menu to see all overdue payments.</b><br/><br/>This page automatically lists all tenants with outstanding balances on past-due invoices. It shows you who owes money, how much they owe, and how many days the payment is overdue. From here, you can use the action buttons to send a pre-filled email reminder or initiate a payment request."
            }
        ]
    },
    {
        "category": "Advanced Tools & AI",
        "questions": [
            {
                "title": "How do I manage maintenance and repairs?",
                "content": "<b>Manage all maintenance tasks using the Kanban board on the 'Maintenance' page.</b><br/><br/>This tool lets you visually track jobs from 'To Do' to 'Done'. When creating a request, you can add a description, set a priority, and assign it to a property and contractor. Once a task is marked as 'Done' and a cost is entered, you can instantly create a corresponding expense record with a single click."
            },
            {
                "title": "What kind of reports can I generate?",
                "content": "<b>Generate interactive financial dashboards and formal AI-powered reports from the 'Reports' page.</b><br/><br/>This section contains two live analysis tabs for Revenue and P&L. Additionally, you can use the AI tools in the header to generate formal documents:<br/><ul><li><b>AI P&L Statement:</b> Creates a downloadable Profit and Loss statement, complete with a narrative summary suitable for stakeholders.</li><li><b>AI Market Research:</b> Generates a detailed analysis of how your rental prices compare to current market rates, with data-backed recommendations.</li></ul>"
            },
            {
                "title": "How does the AI Assistant work?",
                "content": "<b>The AI Assistant is a conversational helper you can ask for information about the app.</b><br/><br/>Accessed via the floating chat bubble, the AI uses the app's official Knowledge Base to answer your questions accurately. If it can't find a specific answer, it will use its general knowledge and inform you. Your chat history is saved, allowing you to continue conversations at any time."
            },
            {
                "title": "What is the Calendar for?",
                "content": "<b>The Calendar provides a visual timeline of all key events across your portfolio.</b><br/><br/>Found in the <b>Menu</b>, it automatically plots important dates from other sections of the app, including tenancy start/end dates, expense transaction dates, and the reported dates of maintenance requests. This helps you anticipate vacancies and track activities at a glance."
            }
        ]
    },
    {
        "category": "Account & Support",
        "questions": [
            {
                "title": "How do I change my settings and profile?",
                "content": "<b>Manage all your preferences from the 'Account' page on the main navigation bar.</b><br/><br/>Here, you can update your name and password, change the app's currency and date format, set your company name for reports, and switch between Light and Dark mode. This is also where you manage your subscription and billing information."
            },
            {
                "title": "How do I use the PropTraka API?",
                "content": "<b>API access is available for Enterprise plan users to programmatically interact with their data.</b><br/><br/>If you are on the Enterprise plan, you can generate a secure API key from the 'API Access' tab on the 'Account' page. This key allows you to build custom integrations, sync data with your other business systems, and automate workflows. The API is designed for developers and requires technical knowledge to use."
            },
            {
                "title": "How do I manage the AI's Knowledge Base?",
                "content": "<b>(Development Only) You can add, edit, or delete articles in the AI's knowledge base from the 'Account' page.</b><br/><br/>Under the 'Knowledge Base' tab, you can manage the content the AI Assistant uses to answer user questions. You can seed the database with the default FAQs or create custom articles to tailor its expertise. This tab is only visible in the development environment."
            },
            {
                "title": "What is the Activity Feed for?",
                "content": "<b>The Activity Feed provides a complete audit trail of all actions taken in your account.</b><br/><br/>Accessible from the main navigation bar, this feed shows a timestamped, chronological list of events like new properties, updated tenancies, logged expenses, and status changes on maintenance requests, making it easy to review all recent activity."
            }
        ]
    }
]
