[
    {
        "category": "Getting Started",
        "questions": [
            {
                "title": "What is PropTraka and who is it for?",
                "content": "<b>PropTraka is the ultimate property management command center for landlords and managers of all sizes.</b><br/><br/>Whether you own a single rental unit or manage a complex portfolio, PropTraka simplifies your operations. It provides a stunning, central dashboard to track finances, manage tenancies, automate billing, and gain AI-driven insights, giving you total control over your assets."
            },
            {
                "title": "How can I test the app with Sample Data?",
                "content": "<b>Instantly populate your dashboard with realistic data to explore PropTraka's full potential.</b><br/><br/>If you are new and haven't added any properties yet, you will see a 'Load Sample Data' button on your main Dashboard. Clicking this will generate a complete demo portfolio—including properties, tenants, leases, and financial transactions—so you can experience the app's features immediately. When you're ready to start for real, simply go to <b>Account > Settings</b> and click 'Clear Sample Data' to wipe the slate clean."
            },
            {
                "title": "How do I sign up or log in?",
                "content": "<b>Get started in seconds with email or Google sign-in.</b><br/><br/>Head to the Sign In page. You can create an account instantly by entering your email and a password, or for a seamless experience, choose 'Sign in with Google'. If you ever forget your password, the 'Forgot Password?' link will help you reset it securely."
            },
            {
                "title": "How does the Dashboard work?",
                "content": "<b>Your Dashboard is the financial heartbeat of your portfolio.</b><br/><br/>It is designed to give you clarity at a glance:<br/><ul><li><b>Live KPIs:</b> The top cards display critical real-time metrics like Total Property Value, Net Operating Income, and Total Arrears.</li><li><b>Financial Visuals:</b> Interactive charts show your cash flow trends and profit breakdowns, helping you spot opportunities and risks instantly.</li></ul>"
            }
        ]
    },
    {
        "category": "Core Features",
        "questions": [
            {
                "title": "How do I manage my properties?",
                "content": "<b>Centralize all your asset details in the 'Properties' page.</b><br/><br/>Accessible from the main navigation bar, this is your digital asset register. You can log detailed specifications for every property—including address, type, and building specs—as well as financial data like purchase price, current market value, and mortgage information."
            },
            {
                "title": "How does the Smart Billing & Revenue system work?",
                "content": "<b>PropTraka automates your billing cycle, handling everything from rent to service charges.</b><br/><br/>When you create a Tenancy in the <b>Revenue</b> section, the system does the heavy lifting:<br/><ul><li><b>Pro-Rata Calculations:</b> If a tenant moves in or out mid-month, the app automatically calculates the exact rent due based on the daily rate.</li><li><b>Recurring Service Charges:</b> Easily add fixed monthly fees (e.g., parking, cleaning) that are billed alongside rent.</li><li><b>Deposit Handling:</b> Security deposits are billed separately and tracked clearly from day one.</li></ul>All invoices are generated automatically for the entire lease term."
            },
            {
                "title": "How do I record a payment?",
                "content": "<b>Track payments with precision in the Tenancy Detail page.</b><br/><br/>Navigate to <b>Revenue</b> and select a tenancy. This opens the detailed billing history. Find the specific invoice (Rent, Deposit, or Service Charge) in the list, click the action menu <b>(...)</b>, and select <b>'Record Payment'</b>. You can log partial or full payments, keeping your ledger accurate to the penny."
            },
            {
                "title": "How do I manage expenses?",
                "content": "<b>Capture every cost effortlessly on the 'Expenses' page.</b><br/><br/>Found in the 'More' menu, the Expenses logger lets you categorize costs, link them to specific properties, and assign them to contractors. You can mark items as recurring to save time and upload receipts for tax compliance."
            },
            {
                "title": "How does document management work?",
                "content": "<b>Keep tenant files organised and accessible.</b><br/><br/>When you manage a tenancy, you can link specific documents directly to that record. Paste URLs for signed contracts, move-in checklists, or ID scans into the Tenancy notes or specific document fields. This ensures that when you look at a tenant's history, every critical document is just one click away."
            },
            {
                "title": "How can I see who is behind on rent?",
                "content": "<b>Eliminate bad debt with the dedicated 'Arrears' tracker.</b><br/><br/>Accessible from the 'More' menu, this page automatically flags any tenant with an overdue balance. It shows exactly how much is owed and how many days late the payment is, allowing you to follow up immediately."
            }
        ]
    },
    {
        "category": "Advanced Tools & AI",
        "questions": [
            {
                "title": "How do I use the AI Assistant?",
                "content": "<b>Your personal property expert, available 24/7.</b><br/><br/>Tap the floating chat bubble to ask the AI anything. It uses this very Knowledge Base to provide accurate answers about the app. <b>NEW:</b> The chat is now connected to your portfolio data! You can ask specific questions like \"Which properties are vacant?\" or \"Who is in arrears?\" and get instant, accurate answers based on your real-time data."
            },
            {
                "title": "How does Smart Maintenance Triage work?",
                "content": "<b>Let AI handle the initial assessment of maintenance requests.</b><br/><br/>When adding a new maintenance request, click <b>\"Analyze with AI\"</b>. The system will read your description (e.g., \"Water heater leaking\") and automatically:<br/><ul><li><b>Categorize</b> the issue (e.g., Plumbing).</li><li><b>Assign Priority</b> based on urgency (e.g., Emergency).</li><li><b>Estimate Costs</b> for repairs.</li></ul>This helps you prioritize jobs and budget effectively without manual guesswork."
            },
            {
                "title": "What is the Tenant Risk Score?",
                "content": "<b>Make data-driven leasing decisions with an AI underwriter.</b><br/><br/>When adding a new tenant, you can use the <b>Risk Assessment</b> tool. Simply enter their income, proposed rent, and employment status. The AI will analyze these factors (checking e.g. Rent-to-Income ratio) and generate a <b>Risk Score (0-100)</b> along with a recommendation (e.g., \"High Risk - Require Guarantor\"). This assessment is saved to the tenant's notes."
            },
            {
                "title": "How do I use the AI Lease Clause Generator?",
                "content": "<b>Draft watertight legal clauses in seconds.</b><br/><br/>Found in <b>More > Lease Tools</b>, this tool turns plain English into professional legal language. Simply describe the rule you want (e.g., \"no pets allowed without written permission\") and the AI will draft a formal clause ready for your tenancy agreement."
            },
            {
                "title": "What reports can I generate?",
                "content": "<b>Turn data into professional insights with AI-powered reporting.</b><br/><br/>In the <b>Reports</b> section, you can generate:<br/><ul><li><b>AI P&L Statement:</b> A downloadable financial statement with a narrative summary explaining your performance to stakeholders.</li><li><b>AI Market Research:</b> Deep-dive analysis comparing your rent against local market trends to maximize your yield.</li></ul>"
            },
            {
                "title": "How do I manage maintenance tasks?",
                "content": "<b>Streamline repairs with a visual Kanban board.</b><br/><br/>The <b>Maintenance</b> page helps you track jobs from 'To Do' to 'Done'. Assign tasks to contractors, set priorities, and when a job is finished, convert it into an Expense record with a single click to keep your books balanced."
            }
        ]
    },
    {
        "category": "Account & API",
        "questions": [
            {
                "title": "How do I manage my settings?",
                "content": "<b>Control your experience from the 'Account' page.</b><br/><br/>Here you can switch between Light and Dark mode, set your preferred currency and date format, and manage your subscription. This is also where you can find the **'Clear Sample Data'** button if you wish to reset your dashboard after testing."
            },
            {
                "title": "What is the PropTraka API?",
                "content": "<b>Enterprise-grade connectivity for developers.</b><br/><br/>Users on the Enterprise plan can use the PropTraka API to programmatically access their data. Whether you're building a custom dashboard or integrating with accounting software, our read-only API endpoints for Properties, Revenue, and Expenses give you the raw data you need."
            }
        ]
    }
]